app/controllers/sessions_controller.rb

    def create
        @session_user = User.new(user_id: params['user']['user_id'], email: params['user']['email'])
        if User.exists?(user_id: params['user']['user_id'])
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "sean"]]
SELECT  1 AS one FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "sean"]]