app/controllers/users_controller.rb

SELECT  1 AS one FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "qwe"]]
INSERT INTO "users" ("user_id", "email", "session_token") VALUES (?, ?, ?)  [["user_id", "tim"], ["email", "tim"], ["session_token", "ce0wuMzO3v93sDDvPag8pg=="]]
---
    def create
        if User.exists?(user_id: params['user']['user_id'])
            flash[:notice] = "User ID is not unique"
            redirect_to new_user_path
        else
            @user = User.new(user_params)
            @user.create_user!(:user_id => params['user']['user_id'], :email => params['user']['email'])